open-watt/urt/src/urt/driver/esp32/ow_shim.c
// OpenWatt ESP-IDF shim -- the single C bridge between D and ESP-IDF.
// Wraps FreeRTOS macros, UART HAL inlines, and anything else that
// needs C headers or static-inline access.

#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "driver/ledc.h"
#include "esp_rom_serial_output.h"
#include "soc/soc_caps.h"
#include <stdbool.h>
#include <stdatomic.h>
#include <string.h>
#include <sys/types.h>
#include <reent.h>
#ifdef OW_USE_LWIP
#include "lwip/netdb.h"
#endif

// ESP32-C3 ROM exports uart_tx_one_char but not esp_rom_uart_putc.
// Provide the missing symbol so the D object links.
#if defined(CONFIG_IDF_TARGET_ESP32C3) && !defined(esp_rom_uart_putc)
void esp_rom_uart_putc(char c) { esp_rom_output_tx_one_char(c); }
#endif

// -- errno accessor (picolibc uses _Thread_local errno, incompatible with emulated-TLS) --

#include <errno.h>

int *ow_errno_location(void)
{
    return &errno;
}

// IDF's no-VFS syscall adapter also dispatches high file descriptors to lwIP.
// Internal-IP builds wrap those entry points so ordinary C stdio stays on the
// console without retaining the socket adapter and, through it, the full stack.
extern ssize_t _write_r_console(struct _reent *r, int fd, const void *data, size_t size);
extern ssize_t _read_r_console(struct _reent *r, int fd, void *data, size_t size);

ssize_t __wrap__write_r(struct _reent *r, int fd, const void *data, size_t size)
{
    return _write_r_console(r, fd, data, size);
}

ssize_t __wrap__read_r(struct _reent *r, int fd, void *data, size_t size)
{
    return _read_r_console(r, fd, data, size);
}

int __wrap__close_r(struct _reent *r, int fd)
{
    (void)fd;
    __errno_r(r) = ENOSYS;
    return -1;
}

int __wrap__fcntl_r(struct _reent *r, int fd, int cmd, int arg)
{
    (void)fd;
    (void)cmd;
    (void)arg;
    __errno_r(r) = ENOSYS;
    return -1;
}

// -- WFI shim --
// Single-instruction inline asm; bound from D as ow_irq_wait. The
// surrounding portENTER_CRITICAL pair is handled D-side via direct
// vPortEnterCritical/vPortExitCritical bindings -- no C wrapper needed.

void ow_irq_wait(void)
{
#if CONFIG_IDF_TARGET_ARCH_XTENSA
    __asm__ volatile("waiti 0");
#elif CONFIG_IDF_TARGET_ARCH_RISCV
    __asm__ volatile("wfi");
#endif
}

// -- GPIO wrappers (software GPIO; peripheral function routing goes
//    through ESP-IDF's signal matrix on a per-peripheral basis, not
//    through this module).

#include "driver/gpio.h"
#include "esp_attr.h"
#include "esp_intr_alloc.h"
#include "soc/gpio_num.h"
#include <stdint.h>

// pull: 0=none, 1=up, 2=down (matches D Pull enum encoding)
static gpio_pull_mode_t ow_pull_to_idf(int pull)
{
    return (pull == 1) ? GPIO_PULLUP_ONLY :
           (pull == 2) ? GPIO_PULLDOWN_ONLY : GPIO_FLOATING;
}

void ow_gpio_output_init(int pin, int initial)
{
    gpio_reset_pin((gpio_num_t)pin);
    gpio_set_direction((gpio_num_t)pin, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)pin, initial);
}

void ow_gpio_input_init(int pin, int pull)
{
    gpio_reset_pin((gpio_num_t)pin);
    gpio_set_direction((gpio_num_t)pin, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t)pin, ow_pull_to_idf(pull));
}

void IRAM_ATTR ow_gpio_output_set(int pin, int value)
{
    gpio_set_level((gpio_num_t)pin, value);
}

int ow_gpio_input_read(int pin)
{
    return gpio_get_level((gpio_num_t)pin);
}

void ow_gpio_set_pull(int pin, int pull)
{
    gpio_set_pull_mode((gpio_num_t)pin, ow_pull_to_idf(pull));
}

void ow_gpio_release(int pin)
{
    gpio_reset_pin((gpio_num_t)pin);
}

uint32_t ow_gpio_count(void)
{
    return SOC_GPIO_PIN_COUNT;
}

int ow_pwm_open(unsigned port, unsigned pin, unsigned frequency, unsigned resolution, unsigned initial_duty, bool inverted)
{
    if (port >= LEDC_TIMER_MAX || port >= LEDC_CHANNEL_MAX)
        return -1;

    ledc_timer_config_t timer = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .duty_resolution = (ledc_timer_bit_t)resolution,
        .timer_num = (ledc_timer_t)port,
        .freq_hz = frequency,
        .clk_cfg = LEDC_AUTO_CLK,
    };
    ledc_channel_config_t channel = {
        .gpio_num = pin,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = (ledc_channel_t)port,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = (ledc_timer_t)port,
        .duty = initial_duty,
        .hpoint = 0,
        .flags = { .output_invert = inverted },
    };
    if (ledc_timer_config(&timer) != ESP_OK)
        return -1;
    return ledc_channel_config(&channel) == ESP_OK ? 0 : -1;
}

int ow_pwm_set_duty(unsigned port, unsigned duty)
{
    if (port >= LEDC_CHANNEL_MAX || ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port, duty) != ESP_OK)
        return -1;
    return ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port) == ESP_OK ? 0 : -1;
}

void ow_pwm_close(unsigned port)
{
    if (port < LEDC_CHANNEL_MAX)
        ledc_stop(LEDC_LOW_SPEED_MODE, (ledc_channel_t)port, 0);
}

#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"

#if defined(CONFIG_IDF_TARGET_ESP32)

#include "soc/rtc_io_struct.h"
#include "soc/sens_reg.h"
#include "soc/sens_struct.h"

#define OW_GPIO_INTERRUPTS 2

typedef struct {
    unsigned input_gpio;
    bool open;
} ow_gpio_interrupt_t;

static portMUX_TYPE adc_locks[2] = {
    portMUX_INITIALIZER_UNLOCKED,
    portMUX_INITIALIZER_UNLOCKED,
};
static ow_gpio_interrupt_t gpio_interrupts[OW_GPIO_INTERRUPTS];
static volatile uintptr_t gpio_interrupt_callbacks[OW_GPIO_INTERRUPTS];
static unsigned gpio_isr_users;
static bool gpio_isr_service_owned;

static int gpio_isr_acquire(void)
{
    if (gpio_isr_users) {
        ++gpio_isr_users;
        return 0;
    }
    if (gpio_install_isr_service(ESP_INTR_FLAG_IRAM) != ESP_OK)
        return -1;
    gpio_isr_service_owned = true;
    gpio_isr_users = 1;
    return 0;
}

static void gpio_isr_release(void)
{
    if (!gpio_isr_users || --gpio_isr_users)
        return;
    if (gpio_isr_service_owned) {
        gpio_uninstall_isr_service();
        gpio_isr_service_owned = false;
    }
}

static adc_atten_t adc_attenuation(unsigned attenuation)
{
    switch (attenuation) {
    case 0: return ADC_ATTEN_DB_0;
    case 1: return ADC_ATTEN_DB_2_5;
    case 2: return ADC_ATTEN_DB_6;
    default: return ADC_ATTEN_DB_12;
    }
}

int ow_adc_open(unsigned unit, void **handle)
{
    if (!handle || unit > ADC_UNIT_2)
        return -1;

    adc_oneshot_unit_init_cfg_t config = {
        .unit_id = (adc_unit_t)unit,
    };
    if (adc_oneshot_new_unit(&config, (adc_oneshot_unit_handle_t *)handle) != ESP_OK)
        return -1;
    return 0;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    if (!handle || !calibration || !calibration_source || unit > ADC_UNIT_2 || bit_width == 0)
        return -1;

    adc_atten_t atten = adc_attenuation(attenuation);
    adc_oneshot_chan_cfg_t input_config = {
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
    };
    adc_cali_line_fitting_config_t calibration_config = {
        .unit_id = (adc_unit_t)unit,
        .atten = atten,
        .bitwidth = (adc_bitwidth_t)bit_width,
        .default_vref = default_reference_mv,
    };
    if (adc_oneshot_config_channel((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &input_config) != ESP_OK)
        return -1;
    if (adc_cali_create_scheme_line_fitting(&calibration_config, (adc_cali_handle_t *)calibration) != ESP_OK)
        return -1;
    adc_cali_line_fitting_efuse_val_t source;
    *calibration_source = adc_cali_scheme_line_fitting_check_efuse(&source) == ESP_OK ? (int)source : -1;
    return 0;
}

