open-watt/urt/src/urt/driver/esp32/ow_shim.c
static uint16_t adc1_read_isr(unsigned channel);

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    int value;
    if (!handle || !raw || unit > ADC_UNIT_2)
        return -1;
    if (unit == ADC_UNIT_1) {
        portENTER_CRITICAL(&adc_locks[unit]);
        value = adc1_read_isr(channel);
        portEXIT_CRITICAL(&adc_locks[unit]);
    } else if (adc_oneshot_read((adc_oneshot_unit_handle_t)handle, (adc_channel_t)channel, &value) != ESP_OK) {
        return -1;
    }
    *raw = (unsigned)value;
    return 0;
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    int value;
    if (!calibration || !millivolts || adc_cali_raw_to_voltage((adc_cali_handle_t)calibration, raw, &value) != ESP_OK)
        return -1;
    *millivolts = (unsigned)value;
    return 0;
}

void ow_adc_input_close(void *calibration)
{
    if (calibration)
        adc_cali_delete_scheme_line_fitting((adc_cali_handle_t)calibration);
}

void ow_adc_close(void *handle)
{
    if (handle)
        adc_oneshot_del_unit((adc_oneshot_unit_handle_t)handle);
}

static uint16_t IRAM_ATTR adc1_read_isr(unsigned channel)
{
    SENS.sar_read_ctrl.sar1_dig_force = 0;
    SENS.sar_meas_wait2.force_xpd_sar = SENS_FORCE_XPD_SAR_PU;
    RTCIO.hall_sens.xpd_hall = false;
    SENS.sar_meas_wait2.force_xpd_amp = SENS_FORCE_XPD_AMP_PD;
    SENS.sar_meas_ctrl.amp_rst_fb_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_fsm = 0;
    SENS.sar_meas_ctrl.amp_short_ref_gnd_fsm = 0;
    SENS.sar_meas_wait1.sar_amp_wait1 = 1;
    SENS.sar_meas_wait1.sar_amp_wait2 = 1;
    SENS.sar_meas_wait2.sar_amp_wait3 = 1;
    SENS.sar_meas_start1.meas1_start_force = 1;
    SENS.sar_meas_start1.sar1_en_pad_force = 1;
    SENS.sar_touch_ctrl1.xpd_hall_force = 1;
    SENS.sar_touch_ctrl1.hall_phase_force = 1;
    SENS.sar_meas_start1.sar1_en_pad = 1U << channel;
    while (SENS.sar_slave_addr1.meas_status != 0) {
    }
    SENS.sar_meas_start1.meas1_start_sar = 0;
    SENS.sar_meas_start1.meas1_start_sar = 1;
    while (SENS.sar_meas_start1.meas1_done_sar == 0) {
    }
    return SENS.sar_meas_start1.meas1_data_sar;
}

static void IRAM_ATTR gpio_interrupt_handler(void *context)
{
    unsigned port = (unsigned)(uintptr_t)context;
    bool (*callback)(unsigned) = (bool (*)(unsigned))gpio_interrupt_callbacks[port];
    if (callback && callback(port))
        portYIELD_FROM_ISR();
}

void ow_gpio_interrupt_close(unsigned port);

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    if (port >= OW_GPIO_INTERRUPTS || input_gpio >= SOC_GPIO_PIN_COUNT || trigger > 4)
        return -1;

    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (interrupt->open || gpio_isr_acquire() != 0)
        return -1;
    static const gpio_int_type_t types[] = {
        GPIO_INTR_POSEDGE,
        GPIO_INTR_NEGEDGE,
        GPIO_INTR_ANYEDGE,
        GPIO_INTR_HIGH_LEVEL,
        GPIO_INTR_LOW_LEVEL,
    };
    interrupt->input_gpio = input_gpio;
    // Input buffer explicitly: the pin may be muxed to a peripheral output (only the output path is
    // routed), and edge detection needs GPIO_IN regardless of who drives the pad.
    if (gpio_input_enable((gpio_num_t)input_gpio) != ESP_OK ||
        gpio_set_intr_type((gpio_num_t)input_gpio, types[trigger]) != ESP_OK ||
        gpio_isr_handler_add((gpio_num_t)input_gpio, gpio_interrupt_handler, (void *)(uintptr_t)port) != ESP_OK) {
        gpio_isr_release();
        return -1;
    }
    interrupt->open = true;
    return 0;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    gpio_interrupt_callbacks[port] = (uintptr_t)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    if (port >= OW_GPIO_INTERRUPTS)
        return;
    ow_gpio_interrupt_t *interrupt = &gpio_interrupts[port];
    if (!interrupt->open)
        return;
    gpio_isr_handler_remove((gpio_num_t)interrupt->input_gpio);
    ow_gpio_interrupt_set_callback(port, NULL);
    interrupt->open = false;
    gpio_isr_release();
}

#else

int ow_adc_open(unsigned unit, void **handle)
{
    (void)unit;
    (void)handle;
    return -1;
}

int ow_adc_input_open(void *handle, unsigned unit, unsigned channel, unsigned attenuation, unsigned bit_width, unsigned default_reference_mv, void **calibration, int *calibration_source)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)attenuation;
    (void)bit_width;
    (void)default_reference_mv;
    (void)calibration;
    (void)calibration_source;
    return -1;
}

int ow_adc_read(void *handle, unsigned unit, unsigned channel, unsigned *raw)
{
    (void)handle;
    (void)unit;
    (void)channel;
    (void)raw;
    return -1;
}

int ow_adc_raw_to_mv(void *calibration, unsigned raw, unsigned *millivolts)
{
    (void)calibration;
    (void)raw;
    (void)millivolts;
    return -1;
}

void ow_adc_input_close(void *calibration)
{
    (void)calibration;
}

void ow_adc_close(void *handle)
{
    (void)handle;
}

int ow_gpio_interrupt_open(unsigned port, unsigned input_gpio, unsigned trigger)
{
    (void)port;
    (void)input_gpio;
    (void)trigger;
    return -1;
}

void ow_gpio_interrupt_set_callback(unsigned port, bool (*callback)(unsigned port))
{
    (void)port;
    (void)callback;
}

void ow_gpio_interrupt_close(unsigned port)
{
    (void)port;
}

#endif

// -- I2C master wrappers --

#include "driver/i2c_master.h"

#ifdef SOC_HP_I2C_NUM
#define OW_I2C_COUNT SOC_HP_I2C_NUM
#else
#define OW_I2C_COUNT SOC_I2C_NUM
#endif
#define I2C_REQUEST_QUEUE_SIZE 1
#define I2C_WORKER_STACK 3072

typedef bool (*ow_i2c_callback_t)(void *context, int result);

typedef struct {
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    const void *write_data;
    size_t write_length;
    void *read_data;
    size_t read_length;
    int timeout_ms;
    ow_i2c_callback_t callback;
    void *callback_context;
} ow_i2c_request_t;

typedef struct {
    i2c_master_bus_handle_t bus;
    i2c_master_dev_handle_t device;
    uint16_t address;
    uint32_t frequency;
    uint8_t address_mode;
    QueueHandle_t queue;
    TaskHandle_t worker;
    SemaphoreHandle_t worker_done;
    StaticSemaphore_t worker_done_storage;
    atomic_bool initialized;
} ow_i2c_context_t;

