open-watt/urt/src/urt/driver/esp32/ow_shim.c
int ow_wifi_set_channel(int primary, int secondary)
{
    return esp_wifi_set_channel((uint8_t)primary,
                                (wifi_second_chan_t)secondary) == ESP_OK ? 1 : 0;
}

// Inject a raw 802.11 frame. ifx selects WIFI_IF_STA (0) or WIFI_IF_AP (1).
// en_sys_seq=true lets the MAC fill the sequence number; the caller can
// still set destination/source MACs and frame control. Used by monitor-mode
// injection paths.
int ow_wifi_raw_tx(int ifx, const uint8_t *frame, int len, int en_sys_seq)
{
    return esp_wifi_80211_tx((wifi_interface_t)ifx, frame, len,
                             en_sys_seq ? true : false) == ESP_OK ? 1 : 0;
}
#else // !CONFIG_ESP_WIFI_ENABLED

typedef void (*ow_wifi_event_cb_t)(int, void *, int);
typedef void (*ow_wifi_rx_cb_t)(const uint8_t *, int, int);
typedef void (*ow_wifi_promisc_cb_t)(int, int, int, int, int, int, const uint8_t *);

int ow_wifi_init(void) { return -1; }
void ow_wifi_deinit(void) {}
int ow_wifi_sta_config(const char *s, const char *p, const uint8_t *b) { (void)s;(void)p;(void)b; return 0; }
int ow_wifi_ap_config(const char *s, const char *p, uint8_t c, uint8_t m, uint8_t h) { (void)s;(void)p;(void)c;(void)m;(void)h; return 0; }
int ow_wifi_ap_set_max_clients(uint8_t m) { (void)m; return 0; }
int ow_wifi_sta_get_ap_info(uint8_t *b, int *r) { (void)b; (void)r; return 0; }
int ow_wifi_set_rx_callback(ow_wifi_rx_cb_t cb) { (void)cb; return 0; }
void ow_wifi_set_sta_callback(ow_wifi_event_cb_t cb) { (void)cb; }
void ow_wifi_set_ap_callback(ow_wifi_event_cb_t cb) { (void)cb; }
int ow_wifi_set_promiscuous(int enable, uint32_t filter_mask) { (void)enable;(void)filter_mask; return 0; }
void ow_wifi_set_promiscuous_callback(ow_wifi_promisc_cb_t cb) { (void)cb; }
int ow_wifi_set_channel(int p, int s) { (void)p;(void)s; return 0; }
int ow_wifi_raw_tx(int ifx, const uint8_t *frame, int len, int en) { (void)ifx;(void)frame;(void)len;(void)en; return 0; }

#endif // CONFIG_ESP_WIFI_ENABLED

// -- BLE (NimBLE) wrappers --

#if CONFIG_BT_ENABLED && CONFIG_BT_NIMBLE_ENABLED
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/ble_gap.h"

static void ow_nimble_host_task(void *param)
{
    (void)param;
    nimble_port_run();
    nimble_port_freertos_deinit();
}

int ow_ble_init(void)
{
    int rc = nimble_port_init();
    if (rc != 0)
        return rc;
    nimble_port_freertos_init(ow_nimble_host_task);
    return 0;
}

int ow_ble_deinit(void)
{
    int rc = nimble_port_stop();
    if (rc != 0)
        return rc;
    nimble_port_deinit();
    return 0;
}

#else // !BT_NIMBLE

int ow_ble_init(void) { return -1; }
int ow_ble_deinit(void) { return 0; }

#endif // CONFIG_BT_NIMBLE_ENABLED

// -- CAN (TWAI) driver --

#if SOC_TWAI_SUPPORTED
#include "esp_twai.h"
#include "esp_twai_onchip.h"

#define OW_CAN_RX_CAP 32
#define OW_CAN_TX_CAP 16

_Static_assert((OW_CAN_RX_CAP & (OW_CAN_RX_CAP - 1)) == 0, "CAN RX capacity must be a power of two");
_Static_assert(OW_CAN_TX_CAP <= 32, "CAN TX capacity exceeds the ownership bitmap");

typedef bool (*ow_can_rx_cb_t)(unsigned port);

typedef struct {
    uint32_t id;
    uint8_t flags;
    uint8_t dlc;
    uint8_t data[8];
} ow_can_frame_t;

typedef struct {
    twai_frame_t frame;
    uint8_t data[8];
} ow_can_tx_slot_t;

typedef struct {
    twai_node_handle_t handle;
    unsigned port;
    ow_can_rx_cb_t rx_cb;
    _Atomic uint32_t rx_head;
    _Atomic uint32_t rx_tail;
    _Atomic uint32_t rx_drops;
    _Atomic uint32_t errors;
    _Atomic uint32_t tx_used;
    ow_can_frame_t rx[OW_CAN_RX_CAP];
    ow_can_tx_slot_t tx[OW_CAN_TX_CAP];
} ow_can_context_t;

static ow_can_context_t ow_can_contexts[SOC_TWAI_CONTROLLER_NUM];

static ow_can_context_t *ow_can_find(twai_node_handle_t handle)
{
    if (!handle)
        return NULL;
    for (unsigned i = 0; i < SOC_TWAI_CONTROLLER_NUM; ++i)
        if (ow_can_contexts[i].handle == handle)
            return &ow_can_contexts[i];
    return NULL;
}

static bool ow_can_rx_done(twai_node_handle_t handle, const twai_rx_done_event_data_t *edata, void *user_ctx)
{
    (void)edata;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint8_t data[64];
    twai_frame_t frame = {
        .buffer = data,
        .buffer_len = sizeof(data),
    };
    if (twai_node_receive_from_isr(handle, &frame) != ESP_OK)
        return false;

    uint16_t length = twaifd_dlc2len(frame.header.dlc);
    uint32_t head = atomic_load_explicit(&ctx->rx_head, memory_order_relaxed);
    uint32_t tail = atomic_load_explicit(&ctx->rx_tail, memory_order_acquire);
    if (length > sizeof(ctx->rx[0].data))
    {
        // The portable frame carries only classic-CAN payloads. Account unsupported FD frames as drops, not queue overruns.
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        return false;
    }
    if (head - tail >= OW_CAN_RX_CAP)
    {
        atomic_fetch_add_explicit(&ctx->rx_drops, 1, memory_order_relaxed);
        atomic_fetch_or_explicit(&ctx->errors, 1u << 5, memory_order_relaxed);
        return false;
    }

    ow_can_frame_t *slot = &ctx->rx[head & (OW_CAN_RX_CAP - 1)];
    slot->id = frame.header.id;
    slot->flags = (frame.header.ide ? 1 : 0) | (frame.header.rtr ? 2 : 0) | (frame.header.fdf ? 4 : 0) | (frame.header.brs ? 8 : 0);
    slot->dlc = (uint8_t)length;
    if (frame.header.rtr)
        memset(slot->data, 0, sizeof(slot->data));
    else if (length > 0)
        memcpy(slot->data, data, length);
    atomic_store_explicit(&ctx->rx_head, head + 1, memory_order_release);
    return ctx->rx_cb ? ctx->rx_cb(ctx->port) : false;
}

static bool ow_can_tx_done(twai_node_handle_t handle, const twai_tx_done_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    if (!edata->is_tx_success)
        atomic_fetch_or_explicit(&ctx->errors, 1u << 4, memory_order_relaxed);
    if (edata->done_tx_frame)
    {
        ow_can_tx_slot_t *slot = (ow_can_tx_slot_t *)edata->done_tx_frame;
        unsigned index = (unsigned)(slot - ctx->tx);
        if (index < OW_CAN_TX_CAP)
            atomic_fetch_and_explicit(&ctx->tx_used, ~(1u << index), memory_order_release);
    }
    return false;
}

static bool ow_can_error(twai_node_handle_t handle, const twai_error_event_data_t *edata, void *user_ctx)
{
    (void)handle;
    ow_can_context_t *ctx = (ow_can_context_t *)user_ctx;
    uint32_t errors = 0;
    // ESP-IDF 6.0 exposes arbitration, bit, form, stuff, and ACK flags here, but no CRC flag.
    if (edata->err_flags.bit_err)
        errors |= 1u << 0;
    if (edata->err_flags.stuff_err)
        errors |= 1u << 1;
    if (edata->err_flags.form_err)
        errors |= 1u << 3;
    if (edata->err_flags.ack_err)
        errors |= 1u << 4;
    atomic_fetch_or_explicit(&ctx->errors, errors, memory_order_relaxed);
    return false;
}

